Tekla Open API Reference for Tekla Structures 2025
String.GetSchema Method
 Gets the XML Schema for the datatype.
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public XmlSchema GetSchema()
Public Function GetSchema As XmlSchema
Return Value
Type: XmlSchema
The datatype's XML Schema.
Implements
IXmlSerializable.GetSchema()
See Also
Reference
String Structure
Tekla.Structures.Datatype Namespace